tap "shivammathur/php"
# Lightweight DNS forwarder and DHCP server
brew "dnsmasq"
# GitHub command-line tool
brew "gh"
# Web and API based SMTP testing tool
brew "mailhog", restart_service: :changed
# HTTP(S) server and reverse proxy, and IMAP/POP3 proxy server
brew "nginx"
# General-purpose scripting language
brew "php", restart_service: :changed, link: false
# General-purpose scripting language
brew "php@8.2"
# General-purpose scripting language
brew "php@8.3", restart_service: :changed, link: true
# Internet file retriever
brew "wget"
# Command-line interface for WordPress
brew "wp-cli"
# Open-source Markdown editor
cask "macdown"
# MySQL/MariaDB database management
cask "sequel-ace"
vscode "adamcaviness.theme-monokai-dark-soda"
vscode "adamsome.vscode-theme-gruvbox-minor"
vscode "andresma.night-nord"
vscode "apility.beautify-blade"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "argyleink.kung-fury"
vscode "austenc.laravel-blade-spacer"
vscode "avetis.nord-palette"
vscode "azemoh.one-monokai"
vscode "bajdzis.vscode-twig-pack"
vscode "balintgyarmathy.nord-deep-visible-comments"
vscode "be5invis.vscode-icontheme-nomo-dark"
vscode "beardedbear.beardedicons"
vscode "beardedbear.beardedtheme"
vscode "benjaminbenais.copilot-theme"
vscode "benszabo.hotline-vice"
vscode "berublan.vscode-log-viewer"
vscode "bierner.markdown-checkbox"
vscode "bmewburn.vscode-intelephense-client"
vscode "box-of-hats.bemhelper"
vscode "carrie999.cyberpunk-2020"
vscode "cjhowe7.laravel-blade"
vscode "curve.nord-dark-pro"
vscode "daltonmenezes.aura-theme"
vscode "divanvisagie.nord-native-theme"
vscode "dnlytras.nord-wave"
vscode "dracula-theme.theme-dracula"
vscode "drakenlords.gruvbox-draken-lords"
vscode "ecmel.vscode-html-css"
vscode "eliverlara.andromeda"
vscode "emilast.logfilehighlighter"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "eserozvataf.one-dark-pro-monokai-darker"
vscode "foxhoundn.synthax"
vscode "gerane.theme-tronlight"
vscode "github.vscode-pull-request-github"
vscode "giuseppezeraschi.ulysses"
vscode "includable.file-duplicate"
vscode "jackpaget.gruvbox-glass"
vscode "janisdd.vscode-edit-csv"
vscode "jdinhlife.gruvbox"
vscode "jock.svg"
vscode "kube.theme-kay"
vscode "lkrms.pretty-php"
vscode "lucasfonte.nightmare"
vscode "madprops.kya"
vscode "marcostazi.vs-code-drupal"
vscode "marlosirapuan.nord-deep"
vscode "marqu3s.aurora-x"
vscode "mblode.twig-language"
vscode "mblode.twig-language-2"
vscode "mechatroner.rainbow-csv"
vscode "mefechoel.njord"
vscode "mehedidracula.php-namespace-resolver"
vscode "metalloriff.city-fog"
vscode "mhutchie.git-graph"
vscode "miguelsolorio.min-theme"
vscode "mr-ubik.hackerman-syntax"
vscode "ms-vscode.theme-tomorrowkit"
vscode "namesmt.blade-php"
vscode "narasimapandiyan.jetbrainsmono"
vscode "negokaz.live-server-preview"
vscode "nord.nord"
vscode "onecentlin.laravel-blade"
vscode "openai.chatgpt"
vscode "origamid.origamid-theme"
vscode "pepri.subtitles-editor"
vscode "redhat.vscode-yaml"
vscode "rholdos.twig-language-support"
vscode "rocketseat.theme-omni"
vscode "rokoroku.vscode-theme-darcula"
vscode "ruslanrystsov.christmas-night"
vscode "s3gf4ult.monokai-vibrant"
vscode "sabrsorensen.party-owl-84"
vscode "sdras.night-owl"
vscode "shufo.vscode-blade-formatter"
vscode "sibiraj-s.vscode-scss-formatter"
vscode "simojanhunen.nord-dark-contrast"
vscode "sonarsource.sonarlint-vscode"
vscode "stanislav.vscode-drupal"
vscode "stnord.vivid-nord"
vscode "thegeoffstevens.best-dark-themes-pack"
vscode "tinkertrain.theme-panda"
vscode "valeryanm.vscode-phpsab"
vscode "vincaslt.highlight-matching-tag"
vscode "vue.volar"
vscode "wayou.vscode-icons-mac"
vscode "wesbos.theme-cobalt2"
vscode "whatwedo.twig"
vscode "willt.nord-nights"
vscode "wintercms.winter-cms"
vscode "wuz.dank-neon"
vscode "xdebug.php-debug"
vscode "yummygum.city-lights-theme"
vscode "zeebo.hacker-colors"
vscode "zhuangtongfa.material-theme"
vscode "zignd.html-css-class-completion"
vscode "zobo.php-intellisense"
